# FoldWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfileWithFold..::..FoldWidth Property
StructuralSectionSigmaProfileWithFold Class See Also
---
Fold segment width.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double FoldWidth { get; set; }
```

Visual Basic
---
```text
Public Property FoldWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FoldWidth {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace